InformationRegisters/ЦеныНаНоменклатуру.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНаНоменклатуру</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗакупочнаяЦена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наценка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентИзмененияЦены</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НоваяЦена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЦеныНаНоменклатуру/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОбновитьЦены()
    Наценка = ?(Запись.Наценка = Неопределено ИЛИ Запись.Наценка < 0, 32, Запись.Наценка);

    НоваяЦена = Запись.ЗакупочнаяЦена * (1 + Наценка / 100);

    ПроцентИзмененияЦены = (НоваяЦена - Запись.ЗакупочнаяЦена) / Запись.ЗакупочнаяЦена * 100;

    Запись.Наценка = Наценка;
    Запись.НоваяЦена = НоваяЦена;
    Запись.ПроцентИзмененияЦены = ПроцентИзмененияЦены;
КонецПроцедуры

&НаКлиенте
Процедура ЗакупочнаяЦенаПриИзменении(Элемент)
    ОбновитьЦены();
КонецПроцедуры

&НаКлиенте
Процедура НаценкаПриИзменении(Элемент)
    ОбновитьЦены();
КонецПроцедуры
